Revit 2026 API

# WallIsValidTargetAttachment Method

---

Says whether the element id can be used as a target for a new attachment.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidTargetAttachment(
	Document doc,
	ElementId targetId
)
```
```vb
Public Shared Function IsValidTargetAttachment (
	doc As Document,
	targetId As ElementId
) As Boolean
```
```cpp
public:
static bool IsValidTargetAttachment(
	Document^ doc,
	ElementId^ targetId
)
```
```fsharp
static member IsValidTargetAttachment :
        doc : Document *
        targetId : ElementId -> bool
```

#### Parameters

doc Document
     Current Revit document.
targetId ElementId
     A proposed target element id for a wall attachment.

#### Return Value

Boolean Returns true if the element id can be used as a target for a new attachment, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Valid targets are roofs, floors, ceilings, toposolids, or other walls.

#### Reference

Wall Class

Autodesk.Revit.DB Namespace